import 'package:fahem/core/resources/fonts_manager.dart';
import 'package:fahem/core/utils/app_provider.dart';
import 'package:fahem/core/utils/extensions.dart';
import 'package:fahem/presentation/shared/previous_button.dart';
import 'package:flutter/material.dart';
import 'package:provider/provider.dart';
import 'package:fahem/core/resources/strings_manager.dart';
import 'package:fahem/core/resources/values_manager.dart';
import 'package:fahem/core/utils/methods.dart';

class PrivacyPolicyScreen extends StatefulWidget {

  const PrivacyPolicyScreen({Key? key}) : super(key: key);

  @override
  State<PrivacyPolicyScreen> createState() => _PrivacyPolicyScreenState();
}

class _PrivacyPolicyScreenState extends State<PrivacyPolicyScreen> {
  late AppProvider appProvider;

  @override
  void initState() {
    super.initState();
    appProvider = Provider.of<AppProvider>(context, listen: false);
  }
  
  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: Methods.getDirection(appProvider.isEnglish),
      child: Scaffold(
        body: SafeArea(
          child: SingleChildScrollView(
            padding: const EdgeInsets.all(SizeManager.s16),
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                Row(
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    const PreviousButton(),
                    const SizedBox(width: SizeManager.s20),
                    Expanded(
                      child: Text(
                        Methods.getText(StringsManager.privacyPolicy, appProvider.isEnglish).toTitleCase(),
                        style: Theme.of(context).textTheme.titleLarge!.copyWith(fontSize: SizeManager.s25, fontWeight: FontWeightManager.black),
                      ),
                    ),
                  ],
                ),
                const SizedBox(height: SizeManager.s20),
                const Text(
                  '''
أولاً :

1) يقصد (بشروط سياسة الخصوصية) طريقة جمع البيانات وطريقة حماية المعلومات الشخصية للمستخدمين وتعد هذه السياسة بغاية الأهمية.

2) يقصد ( بالمستخدم / المستخدمين ) أينما وردت في هذه الاتفاقية، كل من يقوم بإنشاء حساب له على منصة فاهم بقصد الاستفادة من الخدمات المتاحة فيها.

3) لا يعني منصة فاهم أي معلومات شخصية لشخص محدد بعينه، وإنما يتم جمع المعلومات الشخصية من الراغبين باستخدام منصة فاهم بما في ذلك على سبيل المثال لا الحصر طلب الخدمات وتقديمها له والتصفح أو القيام بالاتصال هاتفياً أو بواسطة البريد الالكتروني بفريق خدمة العملاء لدينا، ويعد تزويد المستخدم لنا بمعلوماته الشخصية موافقة منه بمعالجة هذه المعلومات وفقاً لبنود وشروط سياسة الخصوصية.

4) قد يتم تعديل شروط سياسة الخصوصية أو جزء منها في أي وقت، وسيتم نشر النسخة المعدلة على المنصة، وتكون النسخة المعدلة من (سياسة الخصوصية) سارية المفعول بعد أسبوع من تاريخ نشرها، وبعد أسبوع من تاريخ نشرها في المنصة يعتبر استمرارك في استخدام المنصة التزاماً منك بالشروط والبنود الواردة في النسخة المعدلة من سياسة الخصوصية، ورضاً منك في تطبيق التعديلات على بياناتك الشخصية التي كنت قد زودتنا بها.

5) من خلال استخدامك للمنصة فإنك توافق على شروط سياسة الخصوصية، وتعد سياسة الخصوصية اتفاقية ملزمة قانونياً، وإذا تمت إضافة أي ميزات أو أدوات جديدة إلى خدماتنا، فستخضع أيضا لهذه السياسة.

6) سنقوم بحفظ معلوماتك الشخصية، وسيتم استخدامها والكشف عنها وفقا لما تسمح به الأنظمة والقوانين والأعراف المعمول بها بجمهورية مصر العربية.

 7) سوف نقوم بطلب موافقتك دائماً قبل استخدام معلوماتك الشخصية لأغراض غير تلك الأغراض الموضحة في سياسة الخصوصية. 

ثانياً: معلومات المستخدم:

1) نقوم بجمع اسمك وعنوانك وعنوان بريدك الإلكتروني ورقم هاتفك المحمول ومعلومات عامة عنك وعن سجلك المهني، وبيانات حسابك البنكي، وحاجتنا إلى هذه المعلومات لأجل تمكينك من الاستفادة من خدماتنا، على سبيل المثال لا الحصر للتأكد من هويتك والاتصال بك وإصدار الفواتير، وتحويل المبالغ ، وغير ذلك.

2) عند قيامك بإستخدام الخدمات عبر المنصة، سنطلب منك تزويدنا برقم حسابك البنكي ورقم ومعلومات الهوية والسجل التجاري وتاريخ الميلاد، وذلك لمراقبة الاحتيال والمخاطر والامتثال للمتطلبات القانونية والتنظيمية السارية وفق ما تنص عليه القوانين و الأنظمة بجمهورية مصر العربية.

3) عند قيامك بطلب خدمة عبر المنصة، سنطلب منك تزويدنا باسمك الشخصي وقد نطلب منك عند الحاجة رقم ومعلومات الهوية وتاريخ الميلاد، وذلك لمراقبة الاحتيال والمخاطر والامتثال للمتطلبات القانونية والتنظيمية السارية وفق ما تنص عليه القوانين و الأنظمة بجمهورية مصر العربية.

4) باستخدامك للمنصة تقوم بمنحنا صلاحية معرفة موقعك باستخدام خدمة الخرائط في الهاتف أو الجهاز الخاص بك للسماح لنا بتقديم الخدمات على أكمل وجه.

5) نقوم بجمع المعلومات المتعلقة بالخدمات المقدمة وقياس الأداء، ويتضمن ذلك معلومات عن نشاطك مثل كيفية استخدام خدماتنا وكيفية تفاعلك مع الآخرين وغير ذلك.

6) نجمع معلومات خاصة بالجهاز عند تثبيت المنصة، ويتضمن ذلك معلومات مثل نوع الجهاز ومعلومات نظام التشغيل ومعلومات المتصفح وعنوان بروتوكول الإنترنت (IP Address) ومعلومات شبكة الجوال بما في ذلك رقم الهاتف ومعرفات الجهاز، ونجمع معلومات مواقع الجهاز إذا كنت منحتنا صلاحية الوصول لموقعك.

7) نجمع المعلومات المتعلقة بطلب الخدمة وتقديمها والمحادثات والمرفقات والاتصالات التي تتم بين العميل ومقدم الخدمة من خلال المنصة.

 ثالثاً: معلومات زوار المنصة ومستخدمي الدعم:

1) عند قيامك بزيارة المنصة  أو تثبيتها على جهازك نقوم بجمع معلومات عن الاسم وعنوان البريد الإلكتروني ومعلومات الجهاز ونظام التشغيل والمتصفح الذي تستخدمه واتصال الشبكة وعنوان البروتوكول الخاص بك (IP Address) ومعلومات شبكة الجوال بما في ذلك رقم الهاتف ومعرفات الجهاز، ونجمع معلومات مواقع الجهاز إذا كنت منحتنا صلاحية الوصول لموقعك، وقد نتلقى أيضا معلومات شخصية عند إرسال طلبات دعم أو طلبات أخرى إلى المنصة، كما نقوم بجمع نص المحادثة من مستخدمي دعم الدردشة.

2) نقوم بجمع رقم الهاتف وتسجيل المكالمات من مستخدمي الدعم عبر الهاتف، وذلك لقياس الأداء ورفع مستوى الجودة.

3) نقوم بجمع هذه المعلومات عند زيارتك للمنصة أو عند التواصل معنا إما عن طريق البريد الإلكتروني أو الويب أو الرسائل الفورية أو الهاتف كما نجمع أي معلومات إضافية قد تقدمها لنا، وتستخدم المنصة هذه المعلومات لخدمتك وتحسين خدماتها والإجابة عن أية أسئلة قد تكون لديك.

رابعاً: معلومات من ملفات تعريف الارتباط وتقنية التعقب المشابهة:

1) يتم إرسال ملفات تعريف الارتباط إلى الجهاز الخاص بك من موقع على شبكة الانترنت ويتم تخزينها على جهازك، ونقوم بتخصيص ملف تعريف ارتباط مختلف لكل جهاز يتصل بالمنصة.

2) نقوم باستخدام ملفات تعريف الارتباط للتعرف على جهازك وتزويدك بخدمات شخصية، ولعرض إعلانات مخصصة من جوجل أو من جهات أخرى.

3) قد نستخدم تقنيات وأساليب التتبع الآلية على المنصة أثناء إجراء الاتصالات معك أو أثناء استخدامك للمنصة، وذلك لقياس الأداء وتحسين الخدمات.

4) نقوم بتحليل واستخدام المعلومات التي لدينا لتقييم وتحسين خدماتنا والبحث والتطوير واختبار الخدمات والميزات الجديدة، وإجراء أنشطة استكشاف الأخطاء وإصلاحها، ونقوم أيضا باستخدام المعلومات الخاصة بك للرد عليك وإفادتك عند اتصالك بنا. 

خامساً: مشاركة المعلومات الشخصية مع طرف ثالث:

1) قد نلجأ لمشاركة معلوماتك الشخصية مع طرف آخر وذلك للمساعدة في تطوير خدماتنا وتحسينها وإصلاح المشاكل.

2) قد يطلب منا في بعض الظروف من قبل الجهات الحكومية أو القضائية مشاركة المعلومات معهم أو مع طرف ثالث للتحقق من مطالبات قانونية أو لتلبية متطلبات الأمن الوطني أو لتنفيذ الأحكام القضائية، أو غيرها.

3) قد نقوم بمشاركة المعلومات الشخصية مع طرف ثالث للتحقيق أو لاتخاذ إجراءات بشأن الأنشطة غير القانونية أو الاحتيالية المشتبه بها أو الحالات التي تنطوي على تهديدات محتملة للسلامة لأي شخص، أو في حالات انتهاكات بنود اتفاقية الشروط والأحكام أو سياسة الخصوصية أو حسب ما تقتضيه الأنظمة والقوانين.

4) قد نقوم أيضا بمشاركة المعلومات الشخصية مع الجهات التي تتملك المنصة مستقبلاً سواء بالاندماج أو الاستحواذ الكلي أو الجزئي.

5) قد نستخدم معلوماتك التي نجمعها منك للتسويق لخدماتنا والإعلان عنها، وقد نقوم بتقديم هذه المعلومات التي نجمعها إلى شركات أخرى لتسويق منتجاتها أو خدماتها.

 سادساً: أحكام عامة:

1) عند انتهاء علاقتنا معك سنواصل تخزين النسخ المؤرشفة من معلوماتك ومعلومات الخدمات القانونية المقدمة لك لأغراض تجارية ولالتزامنا بالأنظمة والقوانين.

2) عند انتهاء علاقتنا معك سنواصل تخزين معلومات مجهولة المصدر مثل زيارات مواقع الويب بدون معرفات لتحسين خدماتنا.

3) نحتفظ بمعلوماتك بشكل آمن وذلك باتباع معايير في إدارة أمن المعلومات لحماية المعلومات الحساسة مثل المعلومات المالية وتفاصيل أي معلومات شخصية أخرى، وتطبق أنظمة أمن المعلومات الخاصة بنا على الأشخاص والعمليات وأنظمة تكنولوجيا المعلومات على أساس إدارة المخاطر، ويقوم طرف ثالث مؤهل لإدارة وسائل وآلية الدفع وتدقيقها.

4) نؤكد لك أنه لا توجد طريقة إرسال عبر الإنترنت أو طريقة تخزين إلكتروني آمنة 100% ، لذلك لا يمكننا ضمان الأمان المطلق لمعلوماتك.

5) يمكنك الاحتفاظ بجميع معلوماتك الشخصية ومعلومات سجل عملياتك ويمكنك الدخول إليها في أي وقت، كما نمنحك صلاحيات محدودة من إعدادات حسابك للسماح لك بتصحيح أو تعديل أو حذف أو الحد من استخدام المعلومات الشخصية الخاصة بك.

6) قد يترتب على قيامك بحذف أو تقييد استخدام المعلومات الشخصية الخاصة بك، تعطيل الاستفادة من خدماتنا بالشكل الكامل و المرضي للمستخدم.

7) يقر المستخدم بعلمه وموافقته على قيام المنصة بتسجيل المكالمات الصوتية التي تتم من خلال المنصة، وبتخزين مضمون الخدمات القانونية المقدمة وما يتبعها من مرفقات.

8) يحق للمنصة استخدام مضامين الخدمات القانونية وما يتبعها من مرفقات ومكالمات صوتية  لأي غرض تراه مناسباً دون التشهير أو الإساءة للمستخدم.

9) يقر المستخدم بأحقية المنصة باستخدام كل ما ورد في سياسة الخصوصية، وما يطرأ عليها.

10) إذا أشعرت المنصة عبر وسائل التواصل المسجلة في المنصة المستخدم بأي إشعار للاستفادة من المعلومات الخاصة أو أي معلومة أخرى فإن استمرار استخدام المنصة أو عدم الإجابة على الإشعار خلال مدة 3 أيام يعتبر قبول وموافقة بمضمون الإشعار، ولا يحق لمتلقي الإشعار الاعتراض على ما ورد في الإشعار مستقبلاً، ويلتزم بمضمونه
                  ''',
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}