import 'package:fahem/core/resources/fonts_manager.dart';
import 'package:fahem/core/utils/app_provider.dart';
import 'package:fahem/core/utils/extensions.dart';
import 'package:fahem/presentation/shared/previous_button.dart';
import 'package:flutter/material.dart';
import 'package:provider/provider.dart';
import 'package:fahem/core/resources/strings_manager.dart';
import 'package:fahem/core/resources/values_manager.dart';
import 'package:fahem/core/utils/methods.dart';

class TermsOfUseScreen extends StatefulWidget {

  const TermsOfUseScreen({Key? key}) : super(key: key);

  @override
  State<TermsOfUseScreen> createState() => _TermsOfUseScreenState();
}

class _TermsOfUseScreenState extends State<TermsOfUseScreen> {
  late AppProvider appProvider;

  @override
  void initState() {
    super.initState();
    appProvider = Provider.of<AppProvider>(context, listen: false);
  }
  
  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: Methods.getDirection(appProvider.isEnglish),
      child: Scaffold(
        body: SafeArea(
          child: SingleChildScrollView(
            padding: const EdgeInsets.all(SizeManager.s16),
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                Row(
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    const PreviousButton(),
                    const SizedBox(width: SizeManager.s20),
                    Expanded(
                      child: Text(
                        Methods.getText(StringsManager.termsOfUse, appProvider.isEnglish).toTitleCase(),
                        style: Theme.of(context).textTheme.titleLarge!.copyWith(fontSize: SizeManager.s25, fontWeight: FontWeightManager.black),
                      ),
                    ),
                  ],
                ),
                const SizedBox(height: SizeManager.s20),
                const Text(
                  '''
اتفاقية الشروط والأحكام الخاصة بمقدمي الخدمة

فاهم منصة أنشئت من أجل الوساطة في تقديم الخدمات القانونية، باستخدامك لمنصة فاهم فإنك توافق على هذه الاتفاقية من غير قيود أو شروط، ويحق لمنصة فاهم في أي وقت تعديل هذه الاتفاقية وسيتم نشر النسخة المعدلة على المنصة، وتكون النسخة المعدلة من (اتفاقية الشروط والأحكام) سارية المفعول بعد أسبوع من تاريخ نشرها في المنصة، وبعد النشر يعتبر استمرارك في استخدام المنصة، التزاماً منك بالشروط والبنود الواردة في النسخة المعدلة، ورضاً منك في تطبيق التعديلات.

أولاً: يقصد بالمصطلحات التالية متى ما وردت في هذه الاتفاقية – اتفاقية الشروط والأحكام - ما يلي:

1) المستخدم أو العميل: أي شخص يستخدم منصة فاهم للبحث عن مقدمي الخدمات القانونية والاستفادة من خدماتهم.

2) مقدم الخدمة: هو الشخص المتخصص في المجال القانوني أو الشرعي الذي يقوم باستخدام منصة فاهم لاستقبال طلبات الخدمات القانونية المطلوبة من العميل وتنفيذها من خلال منصة فاهم وفقاً لبيانات الشخص المسجلة في المنصة.

3) المنصة: يقصد بها أينما وردت في هذه الاتفاقية أو في سياسة الخصوصية "تطبيق فاهم القانوني بنسختيه سواءً الخاصة بالمحامي أو الخاصة بالمستخدم" ما لم يكن سياق النص لمعنى آخر.

4) الحساب: هو الصفحة/السجل الخاص بمقدم الخدمة المنشأ من أجل أن يتمكن مقدم الخدمة من الاستفادة من خدمات منصة فاهم.

5) الخدمة / الخدمات: هي جميع الخدمات القانونية المتاحة في منصة فاهم.

ثانيا : شروط تسجيل مقدم الخدمة في المنصة :

1) أن يكون كامل الأهلية القانونية و الشرعية .

2) أن يكون حاصل على مؤهل ليسانس الحقوق أو الشريعة و القانون .

3) أن يكون مقيد بنقابة المحامين المصرية و يحمل كارنية النقابة ساري .

4) أن يتقيد في أدائة للخدمة بأحكام قانون المحاماة و القيم و المثل العليا وميثاق الشرف بمهنة المحاماة .

5) أن يزود المنصة بالمعلومات والبيانات الصحيحة المطلوبة للاستفادة من خدماتها، و على الأخص كارنية نقابة المحامين ساري ، المؤهلات العلمية ، وكافة البيانات الشخصية ( بطاقة الرقم القومي ، البطاقة الضريبية ، شهادة التسجيل بالضريبة المضافة ) و كافة الشهادات و الدورات التي يكون حاصل عليها .

6) إذا تبين للمنصة وفقاً لتقديرها الشخصي قيام مقدم الخدمة بخرق أو مخالفة أياً من الشروط أو الأحكام، أو ما يتعلق بها كمخالفة قانون المحاماة و القيم و المثل العليا وميثاق الشرف بمهنة المحاماة  أو الحصول على تقيمات و آراء سيئة من قبل العملاء راغبي الخدمة عن طريق المنصة . 

ثالثاً: أحكام الاستفادة من خدمات المنصة:

1) يقتصر دور منصة فاهم على عرض خدمات مقدمي الخدمة والتوسط بين المستخدم المستفيد ومقدمي الخدمة، ولا تعتبر المنصة مسؤولة عن مستوى وجودة الخدمات المقدمة من مقدمي الخدمة، أو النتائج المترتبة على ذلك، والمسؤولية تقع على مقدم الخدمة وحده فيما يقدمه من آراء أو خدمات.

2) منصة فاهم هي منصة تجارية تقوم بأدوار الوساطة بين مقدمي الخدمات القانونية والمستخدمين، ولا تعتبر المنصة جهة قانونية.

3) يحق لجميع الأفراد والمنشآت الاستفادة من خدمات مقدمي الخدمة عن طريق المنصة، وعلى مقدم الخدمة مسؤولية التحقق من شخصية المستخدم وصفته في طلب الخدمة، مع اعتبار أن البيانات متاحة في المنصة لمقدم الخدمة، وإذا احتاج مقدم الخدمة لبيانات إضافية أو مستندات من أجل إعداد وتقديم الخدمة القانونية على أكمل وجه فإنه يطلبها من المستخدم، شريطة أن تكون فيما يؤثر في تقديم الخدمة، وأن تكون المعلومات محاطة بسرية تامة، ويتحمل مقدم الخدمة المسؤولية في حال إفشائها، وعدم حفظها.

4) يستقبل مقدم الخدمة طلبات المستخدمين على المنصة ويكون الاتفاق المالي وفقاً للآتي:

- مقدم الخدمة يضع سعراً للخدمات القانونية التي سيقدمها عبر المنصة، ويكون السعر في صفحة مقدم الخدمة الشخصية، وهذا السعر خاص بالخدمات القانونية الموجهة مباشرة لمقدم الخدمة، ولا يدخل فيها الخدمات القانونية التي يقبلها مقدم الخدمة بسعر مختلف عن التسعيرة التي حددها في صفحته الشخصية.

- بعض الخدمات القانونية في المنصة والتي تدخل في اختصاص مقدم الخدمة يستطيع مقدم الخدمة تقديم عرض سعر لاستقبالها، ويكون للمستخدم حق المفاضلة بين عروض السعر المقدمة من مقدمي الخدمة في المنصة، واختيار الأنسب له ودفع قيمة الاستشارة له.

- يحق للمنصة دون الحاجة لإشعار أو موافقة مقدم الخدمة التعديل على الآلية المذكورة في تقديم الخدمات والتسعير لها.

5) تحدد مدة تنفيذ الخدمة وفقاً للآتي:

- تبدأ مدة الإستشارة بتفاعل مقدم الخدمة مع الخدمة الموجهة له أو مع الخدمة التي وافق المستخدم على عرض مقدم الخدمة فيها.

- كامل وقت الاستشارة مدفوع من قبل المستخدم وعلى مقدم الخدمة استغلال وقت الاستشارة لتقديم الإجابة والإفادة للمستخدم وعدم استهلاك الوقت على المستخدم دون تحقيق أي فائدة.

- بعد بدأ سريان مدة الاستشارة يجب على مقدم الخدمة التواجد والتفاعل معها بشكل فوري، وأن لا يستغرق أكثر من 8 ساعات لإكمال الرد عليها، مع الأخذ في الاعتبار حاجة ورأي المستخدم في الوقت.

- في حال توقف المستخدم عن إكمال الاستشارة فيمكن لمقدم الخدمة إكمال الرد عليها، وفي حال لم يتفاعل المستخدم معها سيقوم التطبيق بإغلاق الاستشارة بشكل تلقائي، وفقاً للآلية المحددة في منصة فاهم.

- مدة الإستشارة (5 دقائق للاتصال الصوتي + 15 دقيقة للتواصل عبر المحادثة داخل التطبيق) و يتم حساب هذه المدة عند تفاعل مقدم الخدمة عبر الاستشارة، ويمكن للمستخدم تمديد مدة الاستشارة بعد انتهائها، كما يحق للمنصة وحدها دون الحاجة لموافقة مقدم الخدمة أو المستخدم بتعديل وقت الاستشارة وزيادة عدد الدقائق أو تخفيضها أو تعديل آلية احتسابها.

- في كل الأحوال مدة الاستشارة لا يمكن أن تتجاوز بعد التمديد أكثر من نصف ساعة.

- في حال قام المستخدم بتمديد المدة المحددة للاتصال الصوتي في الاستشارة فإن آلية التمديد والقيمة المالية تحتسب بنفس الطريقة المعمول بها في عمليّات تمديد الاستشارات حيث تُحدّد قيمة التمديد بالنسبة والتناسب بالنظر لمدة التمديد وقيمة الاستشارة وتقسم القيمة المحصلة بين المنصة ومقدم الخدمة بحسب الآلية المنصوص عليها في الشروط والأحكام، إلا أن هناك رسوم إضافية يتم فرضها على المستخدم بالإضافة لقيمة التمديد كمقابل عن خدمة (الاتصال الصوتي) وقدر هذه الرسوم (4 جنية لكل دقيقة) وتكون هذه الرسوم كاملة للمنصة ولا يستحق مقدم الخدمة أي شيء منها، كما يحق للمنصة التعديل بزيادة الرسوم أو تخفيضها بحسب ما تراه مناسباً وبما يتوافق مع التكاليف التي تتكبدها.

6) يحق لمنصة فاهم عمل عروض ترويجية وخصومات مالية على قيمة الخدمة، ولا يحق لمقدم الخدمة مطالبة المنصة بتعويضه عن المبالغ المخصومة، أو الاعتراض على العروض التي تقوم بها المنصة.

7) يقوم المستخدم بسداد قيمة الخدمة عن طريق وسائل الدفع المتاحة في المنصة للحساب الخاص بالمنصة، ويتم تحويل مستحقات مقدم الخدمة كل شهر ميلادي بحسب السياسة المتبعة من إدارة المنصة.

8) تستحق منصة فاهم عمولة قدرها (25%) تُحَصَّل من قيمة كل خدمة تقدم على منصة فاهم، بدون شرط ولا قيد، حتى لو كانت الخدمة مكررة من مستخدم واحد، أو من عدة مستخدمين، ويتحمل مقدم الخدمة أي ضرائب حكومية، أو رسوم متعلقة بعمليات الدفع الإلكتروني، أو رسوم متعلقة بإتمام عملية تحويل مستحقاته من المنصة.

9) يحظر على مقدم الخدمة التواصل أو الاتفاق مع المستخدم على إجراء أي أعمال قانونية خارج منصة فاهم، أو تزويد المستخدم بأي معلومات شخصية أو معلومات التواصل التي تخصه أو تخص غيره، أو تخص أي كيان قانوني آخر، ولا يحق له التواصل مع المستخدم خارج المنصة بأي وسيلة كانت، وفي حال قام مقدم الخدمة بمخالفة ذلك فإن منصة فاهم تستحق 50% من المبالغ التي يحصلها مقدم الخدمة بالإضافة إلى أحقية المنصة في الرجوع على مقدم الخدمة بمطالبته بالتعويض عن أي أضرار وقعت، أو أي منافع فاتت على المنصة جراء هذه المخالفة.

10) إذا لم يقدم مقدم الخدمة خدمته بالشكل المطلوب للمستخدم -وفق تقدير فريق المراجعة التابع للمنصة- فإنه لا يستحق أتعابه المالية، و يحق للمستخدم إسترجاع أتعاب الإستشارة من قبل المنصة.

11) في حال قام مقدم الخدمة بطلب تحويل الخدمة القانونية لمقدم خدمة آخر فلا يستحق -مقدم الخدمة طالب التحويل- أي مقابل عن الخدمة التي تم تحويلها بغض النظر عن الأعمال التي قام بتنفيذها.

12) يلتزم مقدم الخدمة بإكمال أي خدمة يباشر العمل عليها ويحظر عليه إنهائها قبل إكمال الرد على المستخدم أو تحويلها لمحامي آخر ما لم يكن هناك سبب مقنع تقبله إدارة المنصة.

13) يلتزم مقدم الخدمة بكافة أحكام وشروط هذه الاتفاقية وفي حال قام مقدم الخدمة بتصرف يخالف ما ورد في هذه الاتفاقية فيحق للمنصة تعطيل استفادته من خدمات المنصة في أي وقت دون سابق إشعار أو إنذار، ولا تتحمل المنصة جراء ذلك أي تعويض أو التزام مالي أو أدبي، كما يحق للمنصة اللجوء للجهة المختصة لمطالبة مقدم الخدمة بالتعويض عن أي ضرر.

14) منصة فاهم لا تطلب من مقدم الخدمة أي معلومات أو مستندات سرية أو خاصة، سوى الطلبات المذكورة في المنصة، أو التي تطلب فيما بعد عن طريق المنصة، وجميع الطلبات المتعلقة بتقديم الخدمة هي من مسؤوليات مقدم الخدمة، ويقع على عاتقه وحده حمايتها وعدم إفشائها.

15) يجب على مقدم الخدمة ألا يقدم أي خدمة إلا بعد التأكد من صحتها وسلامتها، ويعد مقدم الخدمة مسؤولاً عن خدمته المقدمة، ومسؤولاً عن أي مخالفة أو أضرار تنتج عنها.

16) يحق للمنصة تحويل أي خدمة قانونية لدى مقدم الخدمة لمقدم خدمة آخر وذلك حسب ما تراه مناسباً، ومن ذلك على سبيل المثال لا الحصر في حال تأخر مقدم الخدمة على الرد أو في حال قدم رأي يظهر فيه خطأ فني، أو غيره من الأمور التي تقدرها إدارة المنصة.

17) يلتزم مقدم الخدمة بعدم قبول أي خدمة قانونية بعيدة عن إختصاصاته المسجلة على المنصة .

18) يلتزم مقدم الخدمة بالاقتصار على الحد الأعلى من الاختصاصات المحددة من قبل إدارة المنصة.

19) يلتزم مقدم الخدمة بالاطلاع على الخدمة المطلوبة قبل قبولها، ويلتزم بعدم قبول أي خدمة لا يستطيع الرد عليها قانونياً.

20) يجب على مقدم الخدمة عند قبوله لأي خدمة أن يكون متاح للرد عليها بشكل فوري.

21) يحق للمنصة نشر أسماء وصور مقدمي الخدمات، أو نشر شعارات مكاتبهم، أو استخدام بياناتهم المتاحة للعملاء، في أي محتوى تقوم بإعداده وتنشره عبر أي وسائل إعلامية أو تسويقية.

22) يتحمل مقدم الخدمة المسؤولية الكاملة عما يُعرِّف به عن نفسه في صفحته الشخصية، أو غيرها، ويتحمل أي مخالفة قانونية نشأت من جراء ذلك، وتخلي المنصة مسؤوليتها عن ذلك.

23) يتحمل مقدم الخدمة المسؤولية الكاملة عما يقوم بكتابته من آراء قانونية، أو غيرها، ويتحمل أي مخالفة قانونية نشأت من جراء ذلك، وتخلي المنصة مسؤوليتها عن ذلك.

24) يحق للمنصة الاطلاع على الخدمات القانونية المقدمة من مقدمي الخدمات وكافة ما ورد فيها سواءً من رسائل و مقاطع صوتيّة و مستندات كما يحق للمنصة الاستماع للاتصالات الصوتية التي تمت من خلال الاستشارة ودراستها وتوجيه مقدم الخدمة على سبيل الإرشاد في حال لوحظ عليه شيء، ويحق للمنصة في حال رأت أن الخطأ مؤثر على المستخدم التدخل وتقديم الخدمة القانونية للمستخدم ولا يستحق مقدم الخدمة أي مقابل مالي عن الخدمة التي قدمها.

25) لا يحق لمقدم الخدمة استخدام المنصة وتقديم الخدمات فيها إذا كان ممنوعاً من تقديمها من أي جهة، وإذا تبين أن مقدم الخدمة محظور من أي جهة من تقديم خدمات الاستشارات القانونية وغيرها من الخدمات القانونية التي تقدمها المنصة فيتحمل لوحده المسؤولية عن ذلك.

26) يحق للمنصة استخدام الخدمات القانونية التي يقدمها مقدم الخدمة من خلال المنصة والتي هي على سبيل المثال لا الحصر ( الإستشارات القانونية ، الآراء القانونية ، المقالات القانونية ، القوانين و اللوائح ، عقود و إتفاقيات ، المحررات القانونية بأنواعها) كما يحق للمنصة الاستفادة منها لغرض تجاري أو فني أو أي طريقة أخرى تراها مناسبة دون الحاجة لإشعار مقدم الخدمة ولا يستحق مقدم الخدمة أي تكاليف أو مبالغ مُقابل استفادة المنصة من هذه الخدمات.

رابعاً: خدمات الدفع:

1) يقوم المستخدم بالسداد من خلال وسائل الدفع المتاحة في المنصة على الحساب الخاص بالمنصة قبل مباشرة مقدم الخدمة العمل على تنفيذ الخدمة، ولن يتم تقديم الخدمة ولا مباشرة العمل حتى يتم دفع قيمة الخدمة.

2) يحظر على مقدم الخدمة الطلب من المستخدم سداد أتعاب الخدمة لحسابه الخاص.

3) منصة فاهم تقوم بتحويل مستحقات مقدم الخدمة كل شهر ميلادي بحسب السياسة المتبعة من إدارة المنصة.

4) في حال كان مقدم الخدمة مسجلاً في ضريبة القيمة المضافة فيجب عليه تزويد المنصة بنسخة من شهادة الضريبة. يجب على مقدم الخدمة في حال كان مسجلاً في ضريبة القيمة المضافة إشعار المنصة وذلك حتى يتم المعالجة فواتير الخدمة وفقاً لما هو مطلوب من الجهات المختصة، وفي حال لم يقم مقدم الخدمة بذلك فهو من يتحمل كافة التبعات المالية والنظامية، ولا تتحمل المنصة أي مستحقات أو التزامات القانونية و المالية المترتبة على ذلك .

5) لا يحق لمقدم الخدمة مطالبة المنصة بتحصيل ضريبة القيمة المضافة وتحويلها لحسابه في حال لم يقم بتقديم طلب للمنصة قبل رفع المنصة إقراراتها الضريبة الخاصة بالخدمة.

خامساً: المسؤولية:

1) يقتصر عمل منصة فاهم على القيام بخدمة الوساطة والتوفيق (السمسرة) بين المستخدم ومقدم الخدمة وذلك في الخدمات القانونية، ولا تعد المنصة كياناً يقدم الخدمات القانونية.

2) عند تعرض المستخدم لأي أضرار تنتج عن تقصير أو إهمال مقدم الخدمة في تنفيذ الخدمة فإن مقدم الخدمة يتحمل المسؤولية الكاملة أمام المستخدم، ولا تلتزم المنصة بتحمل أي التزامات أو مسؤوليات تجاه المستخدم أو مقدم الخدمة.

3) يتحمل مقدم الخدمة المسؤولية الكاملة لوحده عند قيامه بأي مخالفة لأحكام هذه الاتفاقية، أو مخالفة القوانين و اللوائح.

4) يحق للمستخدم طلب بيانات مقدم الخدمة (لأسم ، و صورة كارنية النقابة ساري ، بطاقة الرقم القومي سارية) من المنصة، عند تعرض المستخدم لخداع مقدم الخدمة أو عدم تقديم الخدمة المطلوبة أو التقصير في تقديمها أو وجود أثر سلبي على المستخدم جراء الخدمة المقدمة، من أجل مطالبته قضائياً باسترداد المبلغ المدفوع، أو شطب أو تقديم الخدمة و التعويض جراء ما تسبب به من أضرار للمستخدم، وذلك بعد دراسة إدارة المنصة لطلب المستخدم وبتها في ذلك، كما يحق للمنصة تزويد المستخدم أو الجهات المختصة بالمعلومات الشخصية لمقدم الخدمة بما في ذلك الاسم وبيانات الهوية وغيرها، والعنوان، وذلك عند ورود بلاغ أو تسجيل شكوى عليه لدى جهات رسمية أو قضائية.

5) بعد تقديم الخدمة من مقدم الخدمة يحق للمستخدم تقييم مقدم الخدمة، وفي حال إساءة المستخدم في التقييم بأي نوع من أنواع الإساءة، فإن مقدم الخدمة يقر بعدم مسؤولية المنصة عن ذلك.

6) منصة فاهم لا تتحمل أي خطأ ينتج عن استخدام مقدم الخدمة أو المستخدم للمنصة، سواء أكان الخطأ بمخالفة الشروط والأحكام، أو باستغلال المستندات الموجودة في المنصة أو المقدمة من المستخدمين أو مقدمي الخدمة، وغيرها، وسواء أكان الخطأ أو المخالفة بقصد أو بغير قصد، فالمنصة تخلي مسؤوليتها عن ذلك.

7) أي مخالفة تقع من مقدم الخدمة ويترتب عليها ضرر للمنصة أو إدخالها في منازعات مع الجهات الرسمية أو القضائية فإن مقدم الخدمة يلتزم بتعويض المنصة عن الأضرار المترتبة عليها جراء هذه المخالفة. كما يتحمل كافة الأتعاب التي تتكبدها المنصة في سبيل ذلك.

8) يقع على مقدم الخدمة مسؤولية الحفاظ على حسابه من دخول أي شخص آخر، ويعد مسؤولاً عن كل ما يصدر من حسابه.

9) في حال إنتهاء سريان نقابة المحامين أو شطب أو زوال أسم مقدم الخدمة من نقابة المحامين لأي سبب من الأسباب ، فيجب عليه التوقف عن تقديم الخدمات عبر المنصة حتى يقوم بتجديد كارنية نقابة المحامين أو إعادة أسمه من الشطب أو الزوال . وفي حال عدم إلتزامه بذلك فإنه يتحمل المسئولية القانونية و المالية أمام المنصة ويحق للمنصة إيقاف الحساب عند نهاية الرخصة مباشرة عند إنتهاء سريان كارنية نقابة المحامين لحين تجديده و إخطار المنصة بذلك .

10) إذا تلاعب مقدم الخدمة في إستخدام خدمات المنصة بأي وسيله و على سبيل المثال التفاعل مع الخدمة المطلوبة  منه وحذف حسابه بعد إنتهاء الوقت المحدد لها من غير تقديم الخدمة المطلوبة بشكل كامل فإنه يتحمل المسؤولية الكاملة، ويلتزم بسداد مقابل الخدمة للمنصة بالإضافة إلى التعويض عن أي أضرار أخرى تلحق بالمنصة جراء هذه المخالفة .

11) إذا قبل مقدم الخدمة، الخدمة المطلوبة فإنه يتحمل المسؤولية الكاملة عند تأخره عن المدة المحددة لتقديم الخدمة للمستخدم ويتحمل التكاليف المترتبة على تأخره في تقديم الخدمة.

سادساً: أحكام عامة:

1) لأي سبب وفقا لسياسة و مراجعات المنصة يحق للمنصة إيقاف حساب مقدم الخدمة وعدم تمكينه من الاستفادة من خدمات المنصة في أي وقت كان، لسبب مشروع أو غير مشروع، على أن تصفي إدارة المنصة مستحقات مقدم الخدمة –إن وجدت- في الوقت المحدد وفقاً لأحكام هذه الاتفاقية، ولا تتحمل المنصة أي مسؤولية جراء ذلك، ولا يعتبر تسجيل مقدم الخدمةملزما لها بإستمراره لديها .

2) يحظر على مقدم الخدمة القيام بأي عمل قد يؤدي إلى حدوث ضغط غير محتمل أو غير متناسب للمنصة أو للبنية التحتية الخاصة بها.

3) يحظر على مقدم الخدمة نشر أو تحميل أي مواد تشهيرية، هجومية، انتهاكية، مضرة، تهديدية، مسيئة، ملتوية أو عنصرية، أو غير ملائمة أخلاقياً .أو مخالفه للقوانين و القرارات و اللوائح المعمول بها بجمهورية مصر العربية.

4) يحظر على مقدم الخدمة الدخول أو القيام بمحاولة دخول غير مصرح بها للمنصة أو منح الآخرين صلاحية استخدام حسابه، أو انتحال أي شخصية أو تحريف العضوية مع شخص آخر، ويتحمل مقدم الخدمة ما يترتب على مخالفته لأحكام هذه الفقرة.

5) يحظر على مقدم الخدمة القيام بعمل من الممكن أن يتسبب بالضرر أو يتضارب مع حقوق الملكية الفكرية للمنصة.

6) يحظر على مقدم الخدمة تحميل أو إرفاق أي ملفات أو برامج أو أي مواد أخرى محمية من قبل قوانين حقوق الملكية الفكرية أو أي حقوق خاصة أو عامة لا يملك حقوق استخدامها.

7) الإرشادات والإشعارات والخطابات والإعلانات التي تتم في المنصة تكون بمثابة الشروط والأحكام، ويقر ويلتزم بها مقدم الخدمة ولا يحق له الاعتراض عليها أو عدم التقيد بها.

8) إذا أشعرت المنصة مقدم الخدمة عبر وسائل التواصل المسجلة في المنصة بأي إشعار يتضمن طلب الموافقة على إجراء معين أو يتضمن الاستفادة من المعلومات الخاصة أو أي معلومة أخرى فإن استمرار مقدم الخدمة في استخدام المنصة أو عدم الإجابة على الإشعار خلال 3 أيام يعتبر قبول وموافقة بمضمون الإشعار، ولا يحق لمقدم الخدمة الاعتراض على ما ورد في الإشعار مستقبلاً، ويلزمه التقيد به.

9) يقر مقدم الخدمة بالإطلاع على شروط الإستخدام و سياسة الخصوصية و الموافقة عليها جميعا و كذا على إرشادات العمل في المنصة والمرسلة له عبر بريده الإلكتروني أو عبر جواله عن طريق الواتساب، ويلتزم بمضمونها.

10) يحق للمنصة مراقبة سير عمل مقدم الخدمة وتنبيهه على المخالفات القانونية والإجرائية، ويحق لها بناءً على ذلك تعطيل حساب مقدم الخدمة.

سابعاً: الإشعارات:

تعد مراسلات منصة فاهم على العناوين الرسمية المدونة في صفحة التسجيل الخاصة بمقدم الخدمة بما في ذلك الواتس أب التابع له أو الإشعارات التي تتم عبر التطبيق إشعارات قانونية منتجة لآثار التبليغ، واستمرار مقدم الخدمة في استخدام المنصة أو عدم الإجابة على الإشعار خلال 3 أيام يعد إقرار بالموافقة على مضمون الإشعارات والمراسلات.

ثامنا : التقاضي و فض المنازعات :

تسري أنظمة و قوانين جمهورية مصر العربية و تختص الجهات القضائية بها.
                  ''',
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}